app/views/customizing_names/index.html.haml

SELECT COUNT(*) FROM "customizings" WHERE "customizings"."customizing_name_id" = ?  [[nil, 1]]
---
                %td= customizing_name.name
                %td= customizing_name.customizings.size