app/views/customizings/index.html.haml

SELECT  "customizing_name".* FROM "customizing_name" WHERE "customizing_name"."customizing_id" = ? LIMIT 1  [[nil, 3]]
SELECT  "customizings".* FROM "customizings" WHERE "customizings"."id" = ? LIMIT 1  [["id", 1]]
---
    -# = @customizings.find(10).version
    =  @customizings.find(10).customizing_name.name