app/controllers/customizings_controller.rb

SELECT "customizings".* FROM "customizings"
SELECT  "customizing_name".* FROM "customizing_name" WHERE "customizing_name"."customizing_id" = ? LIMIT 1  [[nil, 3]]
SELECT  "customizings".* FROM "customizings" WHERE "customizings"."id" = ? LIMIT 1  [["id", 1]]
---
  def index

    @customizings = Customizing.where(nil) # creates an anonymous scope
    # Filteranfragen beantworten
    if params[:software].present?
      @customizings = @customizings.scope_software(params[:software]) if params[:software].present?
    elsif params[:freigabestat].present?
      @customizings = @customizings.scope_freigabe(params[:freigabestat]) if params[:freigabestat].present?
    elsif params[:name_search_text].present?
      # ID's in Namen-Tabelle finden wie unten, dann unten mit IDs filtern
      customizing_names = CustomizingName.where('name LIKE ?', '%' + params[:name_search_text] + '%').all
      @customizings.clear()
      customizing_names.each do |name|
        @customizings += Customizing.where("name_id = ?", name.id)

SELECT  "customizings".* FROM "customizings" WHERE "customizings"."id" = ? LIMIT 1  [["id", 3]]
---
    def set_customizing
      @customizing = Customizing.find(params[:id])