app/controllers/customizing_names_controller.rb

  def index
    @customizing_names = CustomizingName.where(nil) # creates an anonymous scope
    # Filteranfragen beantworten
    if params[:name_search_text].present?
      @customizing_names = CustomizingName.where('name LIKE ?', '%' + params[:name_search_text] + '%').all
    else
      @customizing_names = CustomizingName.all
---
SELECT "customizing_names".* FROM "customizing_names"

    def set_customizing_name
      @customizing_name = CustomizingName.find(params[:id])
---
SELECT  "customizing_name".* FROM "customizing_name" WHERE "customizing_name"."id" = ? LIMIT 1  [["id", 1]]